app/Controllers/CustomerController.php

    public function index()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll(); // Replaces static array
---
SELECT *
FROM `customers`